УправлениеИТФирмой_First/src/DataProcessors/ПриглашениеНаВечеринку/ПриглашениеНаВечеринку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПриглашениеНаВечеринку</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоЕст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоПьёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БудетСНочёвкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

УправлениеИТФирмой_First/src/DataProcessors/ПриглашениеНаВечеринку/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Сохранить(Команда)
	
	Приглашение = Объект.Имя + Объект.ЧтоЕст + Объект.ЧтоПьёт + Объект.БудетСНочёвкой;
	
	Если Объект.БудетСНочёвкой = Истина Тогда
		Ночёвка = ("Нужна кровать")
	Иначе 
		Ночёвка = ("Кровать не нужна");
	КонецЕсли; 
	
	Сообщить(СтрШаблон("Придет: %1 Будет есть: %2 Будет пить: %3", Объект.Имя, Объект.ЧтоЕст, Объект.ЧтоПьёт));
	//Сообщить(СтрШаблон("Придет: %1", Объект.Имя));
	//Сообщить(СтрШаблон("Будет есть: %1", Объект.ЧтоЕст));
	//Сообщить(СтрШаблон("Будет пить: %1", Объект.ЧтоПьёт));
	Сообщить(Ночёвка);
	
КонецПроцедуры
